{
    "questions": [
        {
            "id": "Q1",
            "text": "Is the aim of this study to predict future events (prognostic) or current disease status (diagnostic)?"
        },
        {
            "id": "Q2",
            "text": "On what basis were eligible participants included in this study (symptons, previous tests, registry, etc.)?"
        },
        {
            "id": "Q3",
            "text": "How were participants sampled in this study: by convenience, randomly, or consecutively?"
        },
        {
            "id": "Q4",
            "text": "How was the dataset described in this study before predictive modeling was performed?"
        },
        {
            "id": "Q5",
            "text": "What was the proedure for splitting the dataset into training, validation, and test sets in this study?"
        },
        {
            "id": "Q6",
            "text": "What preprocessing techniques on the included variables/features were applied in this study?"
        },
        {
            "id": "Q7",
            "text": "How is missing data handled in this study?"
        },
        {
            "id": "Q8",
            "text": "How are outliers handled in this study?"
        },
        {
            "id": "Q9",
            "text": "Which prediction models were used in this study?"
        },
        {
            "id": "Q10",
            "text": "What considerations were given to model selection and hyperparameter tuning in this study?"
        },
        {
            "id": "Q11",
            "text": "Is the performance of the predictive models benchmarked or compared to a baseline?"
        },
        {
            "id": "Q12",
            "text": "Which type of explainability techniques are used?"
        },
        {
            "id": "Q13",
            "text": "Which evaluation metrics or outcome measures are used to assess the predictive models?"
        },
        {
            "id": "Q14",
            "text": "What considerations were given to selected evaluation metrics or outcome measures in this study?"
        },
        {
            "id": "Q15",
            "text": "How were robustness, confidence or statistical significance of the results assessed in this study?"
        },
        {
            "id": "Q16",
            "text": "What limitations of the study were discussed?"
        }
    ]
}